SITE_URL = 'https://asbam.com.ua'

CITY_ID = '2054'

PHARMACIES_LVIV = {
    # '128': 'Широка',  # м. Львів, вул. Широка, 64 (Левандівка)
    # '158': 'Стрийська',  # м. Львів, вул. Стрийська, буд. 51
    '170': 'Городоцька',  # м. Львів, вул. Городоцька, буд. 82
    # '738': 'Любінська',  # м. Львів, вул.Любінська,102
    # '777': 'Володимира Великого',  # м. Львів, вул.Володимира Великого,27
    # '398': 'Сихівська',  # м. Львів, вул. Сихівська, 8
    # '472': 'Мазепи'  # м. Львів, вул. Мазепи, 10
}
# default
PHARMACY_COOKIE = {
    'city_id': CITY_ID,
    'warehouse_id': '170',
}
